steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  uint32_t enterMs = millis();
#if INKTIME_PHOTOPAINTER_ENABLED
  uint32_t lastPowerCheckMs = enterMs;
  bool usbServiceActive = photoPainter.usbConnected();
#endif

  for (;;) {
    server.handleClient();

#if INKTIME_PHOTOPAINTER_ENABLED
    if (millis() - lastPowerCheckMs >= 5000) {
      photoPainter.refreshPowerState();
      lastPowerCheckMs = millis();
      if (usbServiceActive && !photoPainter.usbConnected()) {
        goDeepSleepMinutes(minutesToNextRefreshFromLastEpoch(g_cfg));
      }
      usbServiceActive = photoPainter.usbConnected();
    }
#else
    const bool usbServiceActive = false;
#endif

    if (!usbServiceActive && millis() - enterMs > AP_TIMEOUT_MS) {
#if DEBUG_LOG
      DBG_PRINTLN("[AP] timeout: no config saved");
#endif
      uint32_t mins = minutesToNextRefreshFromLastEpoch(g_cfg);
#if DEBUG_LOG
      DBG_PRINT("[AP] sleep to next refresh, minutes="); DBG_PRINTLN((int)mins);
#endif
      delay(50);
      goDeepSleepMinutes(mins);
    }

    delay(10);
  }
}

#if INKTIME_PHOTOPAINTER_ENABLED
// A confirmed USB source keeps the existing configuration WebServer available.
// The project has no MQTT client to migrate; battery operation remains one-shot.
bool runUsbServiceMode() {
  photoPainter.refreshPowerState();
  if (!photoPainter.usbConnected()) return false;
  // USB power alone is not authorization to alter Wi-Fi or a device token.
  if (!isFactoryResetRequestedAtBoot()) return false;
  portalSetupSecret = randomPortalSecret();
  portalNonce = randomPortalSecret();
  portalSaveAttempts = 0;
  portalSaveAllowed = true;

  server.on("/", HTTP_GET, handleRoot);
  server.on("/save", HTTP_POST, handleSave);
  server.begin();
#if DEBUG_LOG
  DBG_PRINTLN("[USB] configuration WebServer remains awake until VBUS removal");
#endif

  uint32_t lastPowerCheckMs = millis();
  while (photoPainter.usbConnected()) {
    server.handleClient();
    if (millis() - lastPowerCheckMs >= 5000) {
      photoPainter.refreshPowerState();
      lastPowerCheckMs = millis();
    }
    delay(10);
  }
  server.stop();
  return true;
}
#endif

// =======================
//  WiFi 连接
// =======================
bool connectWiFi(const Config &cfg, uint32_t timeout_ms = 12000) {
#if DEBUG_LOG
  DBG_PRINTLN("[WIFI] connectWiFi()");
  DBG_PRINT("[WIFI] target ssid="); DBG_PRINTLN(cfg.wifi_ssid);
#endif

  if (cfg.wifi_ssid.isEmpty()) return false;

  WiFi.disconnect(false, false);
  WiFi.mode(WIFI_STA);

  WiFi.setSleep(true);
  WiFi.setTxPower(WIFI_POWER_8_5dBm);
  WiFi.begin(cfg.wifi_ssid.c_str(), cfg.wifi_pass.c_str());

  uint32_t start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < timeout_ms) {
    delay(200);
#if DEBUG_LOG
    DBG_PRINT(".");
#endif
  }
#if DEBUG_LOG
  DBG_PRINTLN();
#endif

  bool ok = (WiFi.status() == WL_CONNECTED);

#if DEBUG_LOG
  if (ok) {
    DBG_PRINTLN("[WIFI] connected");
    DBG_PRINT("[WIFI] IP="); DBG_PRINTLN(WiFi.localIP());
  } else {
    DBG_PRINTLN("[WIFI] connect FAILED");
  }
#endif

  return ok;
}

// =======================
//  NTP 同步时间
// =======================
bool syncTime(const Config &cfg, struct tm &outLocal) {
#if DEBUG_LOG
  DBG_PRINTLN("[TIME] syncTime start");
#endif
  long offsetSec = (long)cfg.tz_offset_minutes * 60;
  configTime(offsetSec, 0, "pool.ntp.org", "time.nist.gov", "ntp.aliyun.com");

  for (int i = 0; i < 30; ++i) {
    if (getLocalTime(&outLocal)) {
#if DEBUG_LOG
      char buf[64];
      strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &outLocal);
      DBG_PRINT("[TIME] OK: "); DBG_PRINTLN(buf);
#endif
      time_t nowEpoch = time(nullptr);
      if (nowEpoch > 0) {
        saveLastTimeEpoch(nowEpoch);
#if INKTIME_PHOTOPAINTER_ENABLED
        photoPainter.writeRtc(nowEpoch);
#endif
      }
      return true;
    }
    delay(500);
  }
#if DEBUG_LOG
  DBG_PRINTLN("[TIME] syncTime FAILED");
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
  time_t rtcEpoch = 0;
  if (photoPainter.readRtc(rtcEpoch)) {
    struct timeval value = {rtcEpoch, 0};
    settimeofday(&value, nullptr);
    localtime_r(&rtcEpoch, &outLocal);
    saveLastTimeEpoch(rtcEpoch);
#if DEBUG_LOG
    DBG_PRINTLN("[TIME] restored from PCF85063");
#endif
    return true;
  }
#endif
  return false;
}

static bool normalizedBackendBase(const Config &cfg, String &base) {
  base = cfg.backend_hostport;
  base.trim();
  if (!base.startsWith("http://") && !base.startsWith("https://")) base = "https://" + base;
  while (base.endsWith("/")) base.remove(base.length() - 1U);
  const int schemeEnd = base.indexOf("://");
  const String origin = schemeEnd >= 0 ? base.substring(schemeEnd + 3) : String("");
  if (origin.length() == 0U || origin.indexOf('/') >= 0 || origin.indexOf('?') >= 0
      || origin.indexOf('#') >= 0 || origin.indexOf('@') >= 0) {
    lastDeviceErrorCode = "DEVICE-BACKEND-ORIGIN";
    lastDeviceErrorMessage = "Backend 必須是不含帳密、路徑、Query 或 Fragment 的 Origin";
    return false;
  }
  return backendTransportAllowed(base, cfg.ca_pem);
}

static constexpr uint64_t kPairingMinimumEpoch = 1700000000ULL;
static constexpr uint32_t kPairingPollWindowMs = 30000U;
static constexpr uint32_t kPairingPollDelayMs = 3000U;

static uint64_t pairingNowEpoch() {
  time_t now = time(nullptr);
  if (now >= static_cast<time_t>(kPairingMinimumEpoch)) return static_cast<uint64_t>(now);
  if (loadLastTimeEpoch(now) && now >= static_cast<time_t>(kPairingMinimumEpoch)) {
    return static_cast<uint64_t>(now);
  }
  return 0U;
}

static uint64_t pairingRetryNowEpoch() {
  const time_t now = time(nullptr);
  return now >= static_cast<time_t>(kPairingMinimumEpoch)
    ? static_cast<uint64_t>(now) : 0U;
}

static uint32_t pairingBackoffForAttempt(uint8_t attempt) {
  return inktime::pairing::backoffSeconds(attempt);
}

static bool pairingRetryDue(const Config &cfg) {
  return inktime::pairing::retryDue(
    retryStateFromConfig(cfg), pairingRetryNowEpoch());
}

static uint32_t pairingBackoffSeconds(const Config &cfg) {
  return inktime::pairing::sleepSeconds(
    retryStateFromConfig(cfg), pairingRetryNowEpoch());
}

static bool pairingExpiryPassed(const Config &cfg) {
  const uint64_t now = pairingNowEpoch();
  return cfg.pairing_expires_at_epoch != 0U
    && now != 0U
    && now >= cfg.pairing_expires_at_epoch;
}

static bool savePairingCandidate(Config &cfg, const Config &candidate) {
  String persistError;
  if (!saveConfig(candidate, &persistError)) {
    setConfigPersistenceError(persistError);
    return false;
  }
  cfg = candidate;
  return true;
}

static bool persistPairingRetry(Config &cfg, const String &state) {
  Config candidate = cfg;
  candidate.auth_state = state;
  const uint8_t previousAttempt = candidate.pairing_retry_attempt;
  candidate.pairing_retry_attempt = previousAttempt < 8U
    ? static_cast<uint8_t>(previousAttempt + 1U) : 8U;
  const uint64_t now = pairingNowEpoch();
  candidate.pairing_retry_at_epoch = now == 0U
    ? 0U : now + pairingBackoffForAttempt(previousAttempt);
  return savePairingCandidate(cfg, candidate);
}

static bool persistRepairPermissionRetry(Config &cfg) {
  PairingRetryMetadataStore retryStore;
  const inktime::pairing::RetryState current = retryStateFromConfig(cfg);
  const inktime::pairing::RetryState next = inktime::pairing::nextRetryState(
    current, pairingRetryNowEpoch());
  applyRetryStateToConfig(next, cfg);
  if (!(next == current)) {
    String error;
    if (!retryStore.save(next, error)) {
      setConfigPersistenceError(error);
      return false;
    }
  }
  return true;
}

static bool clearRepairPermissionRetry() {
  PairingRetryMetadataStore retryStore;
  String error;
  if (!retryStore.clear(error)) {
    setConfigPersistenceError(error);
    return false;
  }
  return true;
}

static bool persistPairingExpired(Config &cfg) {
  Config candidate = cfg;
  // An unconfirmed envelope is no longer usable after expiry.  Clear its
  // locally persisted material so a fresh enrollment can proceed.  If this
  // was a repair flow for an existing device, the backend's
  // repair_allowed_until gate still requires a new explicit admin permission
  // before the next request can succeed.
  candidate.auth_state = "pairing_expired";
  candidate.credential_version = 0U;
  candidate.device_secret = "";
  candidate.pairing_id = "";
  candidate.pairing_nonce = "";
  candidate.pairing_expires_at_epoch = 0U;
  const uint8_t previousAttempt = candidate.pairing_retry_attempt;
  candidate.pairing_retry_attempt = previousAttempt < 8U
    ? static_cast<uint8_t>(previousAttempt + 1U) : 8U;
  const uint64_t now = pairingNowEpoch();
  candidate.pairing_retry_at_epoch = now == 0U
    ? 0U : now + pairingBackoffForAttempt(previousAttempt);
  return savePairingCandidate(cfg, candidate);
}

static bool automaticPairingAllowed(const Config &cfg) {
#if INKTIME_PHOTOPAINTER_ENABLED
  if (cfg.delivery_mode == "stock_compat") return false;
#endif
  if (cfg.auth_state == "credential_issued") {
    return cfg.device_secret.length() > 0U
      && cfg.pairing_id.length() > 0U
      && cfg.pairing_nonce.length() > 0U
      && pairingRetryDue(cfg);
  }
  if (cfg.auth_state != "unpaired" && cfg.auth_state != "pairing_pending"
      && cfg.auth_state != "pairing_expired") return false;
  const bool credentialCanBeIssued = cfg.device_secret.length() == 0U
    && cfg.device_token.length() == 0U;
  if (cfg.auth_state != "pairing_pending" && !credentialCanBeIssued) return false;
  return pairingRetryDue(cfg);
}

static bool checkRepairPermission(Config &cfg) {
  if (cfg.auth_state != "auth_invalid" && cfg.auth_state != "revoked") return false;
  if (deviceCredential(cfg).length() == 0U) {
    lastDeviceErrorCode = "DEVICE-PAIRING-PERMISSION-CREDENTIAL";
    lastDeviceErrorMessage = "重新配對 permission 缺少現有 credential；本輪停止網路工作";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  String base;
  if (!normalizedBackendBase(cfg, base)) {
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }

  inktime::DeviceHttpTransport transport(cfg.ca_pem);
  HTTPClient http;
  String transportCode;
  String transportMessage;
  if (!transport.begin(
        http, base + String(DEVICE_PAIRING_REPAIR_PERMISSION_PATH), 15000,
        transportCode, transportMessage)) {
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-PERMISSION-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "重新配對 permission URL 無法初始化";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  if (!addDeviceAuthorization(http, cfg, true)) {
    http.end();
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  const char* headers[] = {"Content-Type"};
  http.collectHeaders(headers, 1);
  const int status = http.GET();
  const int length = http.getSize();
  const String contentType = http.header("Content-Type");
  if (status != HTTP_CODE_OK || length <= 0 || length > 2048
      || !contentType.startsWith("application/json")) {
    http.end();
    lastDeviceErrorCode = "DEVICE-PAIRING-PERMISSION";
    lastDeviceErrorMessage = "管理員尚未允許重新配對；本輪不建立 pairing request";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  JsonDocument response;
  const DeserializationError jsonError = deserializeJson(response, http.getStream());
  http.end();
  const String statusValue = response["status"] | "";
  const String authorizedDeviceId = response["device_id"] | "";
  if (jsonError || response.overflowed() || statusValue != "pairing_allowed"
      || authorizedDeviceId != cfg.device_id) {
    lastDeviceErrorCode = "DEVICE-PAIRING-PERMISSION-SCHEMA";
    lastDeviceErrorMessage = "重新配對 permission response schema 不合法";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  Config candidate = cfg;
  candidate.auth_state = "pairing_pending";
  candidate.pairing_id = "";
  candidate.pairing_nonce = "";
  candidate.pairing_expires_at_epoch = 0U;
  candidate.pairing_retry_at_epoch = 0U;
  candidate.pairing_retry_attempt = 0U;
  if (!savePairingCandidate(cfg, candidate)) return false;
  return clearRepairPermissionRetry();
}

static bool confirmPairingCredential(Config &cfg, const String &base) {
  if (cfg.device_secret.length() == 0U || cfg.credential_version == 0U
      || cfg.device_id.length() == 0U || cfg.pairing_id.length() == 0U
      || cfg.pairing_nonce.length() == 0U) return false;
  JsonDocument confirmRequest;
  confirmRequest["pairing_id"] = cfg.pairing_id;
  confirmRequest["device_id"] = cfg.device_id;
  confirmRequest["pairing_nonce"] = cfg.pairing_nonce;
  String confirmBody;
  serializeJson(confirmRequest, confirmBody);

  inktime::DeviceHttpTransport transport(cfg.ca_pem);
  HTTPClient http;
  String transportCode;
  String transportMessage;
  if (!transport.begin(
        http, base + String(DEVICE_PAIRING_CONFIRM_PATH), 15000,
        transportCode, transportMessage)) {
    (void)persistPairingRetry(cfg, "credential_issued");
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-CONFIRM-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "配對 confirm URL 無法初始化";
    return false;
  }
  const char* headers[] = {"Content-Type"};
  http.collectHeaders(headers, 1);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("Authorization", "Bearer " + cfg.device_secret);
  http.addHeader("X-InkTime-Credential-Version", String(cfg.credential_version));
  const int status = http.POST(confirmBody);
  const int length = http.getSize();
  const String contentType = http.header("Content-Type");
  if (status == HTTP_CODE_GONE) {
    http.end();
    (void)persistPairingExpired(cfg);
    lastDeviceErrorCode = "DEVICE-PAIRING-EXPIRED";
    lastDeviceErrorMessage = "credential envelope 已過期；等待管理員明確允許 repair";
    return false;
  }
  if (status != HTTP_CODE_OK || length <= 0 || length > 4096
      || !contentType.startsWith("application/json")) {
    http.end();
    (void)persistPairingRetry(cfg, "credential_issued");
    lastDeviceErrorCode = "DEVICE-PAIRING-CONFIRM";
    lastDeviceErrorMessage = "配對 credential 尚未完成 confirm；保留暫存 credential 供下次恢復";
    return false;
  }
  JsonDocument response;
  const DeserializationError jsonError = deserializeJson(response, http.getStream());
  http.end();
  const String statusValue = response["status"] | "";
  const String confirmedDeviceId = response["device_id"] | "";
  if (jsonError || response.overflowed()
      || (statusValue != "confirmed" && statusValue != "already_confirmed")
      || confirmedDeviceId != cfg.device_id) {
    (void)persistPairingRetry(cfg, "credential_issued");
    lastDeviceErrorCode = "DEVICE-PAIRING-CONFIRM-SCHEMA";
    lastDeviceErrorMessage = "配對 confirm response schema 不合法；保留暫存 credential";
    return false;
  }
  Config candidate = cfg;
  candidate.auth_state = "paired";
  candidate.pairing_id = "";
  candidate.pairing_nonce = "";
  candidate.pairing_expires_at_epoch = 0U;
  candidate.pairing_retry_at_epoch = 0U;
  candidate.pairing_retry_attempt = 0U;
  if (!savePairingCandidate(cfg, candidate)) return false;
  deviceAuthInvalid = false;
  lastDeviceErrorCode = "";
  lastDeviceErrorMessage = "";
  return true;
}

static bool claimPairingCredential(Config &cfg, const String &base) {
  if (cfg.pairing_id.length() == 0U || cfg.pairing_nonce.length() == 0U
      || pairingExpiryPassed(cfg)) {
    (void)persistPairingExpired(cfg);
    lastDeviceErrorCode = "DEVICE-PAIRING-EXPIRED";
    lastDeviceErrorMessage = "配對請求已過期；等待 bounded backoff 後重新建立";
    return false;
  }
  const uint32_t pollStarted = millis();
  while (static_cast<uint32_t>(millis() - pollStarted) < kPairingPollWindowMs) {
    JsonDocument claimRequest;
    claimRequest["pairing_id"] = cfg.pairing_id;
    claimRequest["pairing_nonce"] = cfg.pairing_nonce;
    String claimBody;
    serializeJson(claimRequest, claimBody);
    inktime::DeviceHttpTransport transport(cfg.ca_pem);
    HTTPClient http;
    String transportCode;
    String transportMessage;
    if (!transport.begin(
          http, base + String(DEVICE_PAIRING_CLAIM_PATH), 15000,
          transportCode, transportMessage)) {
      (void)persistPairingRetry(cfg, "pairing_pending");
      lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-CLAIM-URL";
      lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "配對 claim URL 無法初始化";
      return false;
    }
    const char* headers[] = {"Content-Type"};
    http.collectHeaders(headers, 1);
    http.addHeader("Content-Type", "application/json");
    const int status = http.POST(claimBody);
    const int length = http.getSize();
    const String contentType = http.header("Content-Type");
    if (status == HTTP_CODE_ACCEPTED) {
      http.end();
      delay(kPairingPollDelayMs);
      continue;
    }
    if (status == HTTP_CODE_GONE) {
      http.end();
      (void)persistPairingExpired(cfg);
      lastDeviceErrorCode = "DEVICE-PAIRING-EXPIRED";
      lastDeviceErrorMessage = "配對請求已過期；等待 bounded backoff 後重新建立";
      return false;
    }
    if (status != HTTP_CODE_OK || length <= 0 || length > 8192
        || !contentType.startsWith("application/json")) {
      http.end();
      (void)persistPairingRetry(cfg, "pairing_pending");
      lastDeviceErrorCode = "DEVICE-PAIRING-CLAIM";
      lastDeviceErrorMessage = "配對 claim HTTP／Content-Type／長度不合法；保留 pairing state";
      return false;
    }
    JsonDocument response;
    const DeserializationError jsonError = deserializeJson(response, http.getStream());
    http.end();
    const String secret = response["device_secret"] | "";
    const JsonVariantConst versionValue = response["credential_version"];
    const String claimedDeviceId = response["device_id"] | "";
    if (jsonError || response.overflowed() || secret.length() < 32U
        || secret.length() > inktime::configstore::kMaxDeviceSecretBytes
        || !versionValue.is<uint32_t>() || versionValue.is<bool>() || versionValue.as<uint32_t>() == 0U
        || claimedDeviceId != cfg.device_id) {
      (void)persistPairingRetry(cfg, "pairing_pending");
      lastDeviceErrorCode = "DEVICE-PAIRING-SCHEMA";
      lastDeviceErrorMessage = "配對 claim credential schema 不合法；保留 pairing state";
      return false;
    }
    Config candidate = cfg;
    candidate.device_secret = secret;
    candidate.credential_version = versionValue.as<uint32_t>();
    candidate.auth_state = "credential_issued";
#if INKTIME_PHOTOPAINTER_ENABLED
    JsonObject claimConfig = response["config"].as<JsonObject>();
    const String delivery = claimConfig["delivery_mode"] | candidate.delivery_mode;
    const String button = claimConfig["button_wake_action"] | candidate.button_wake_action;
    if (validDeliveryMode(delivery)) candidate.delivery_mode = delivery;
    if (validButtonWakeAction(button)) candidate.button_wake_action = button;
#endif
    candidate.pairing_retry_at_epoch = 0U;
    candidate.pairing_retry_attempt = 0U;
    if (!savePairingCandidate(cfg, candidate)) return false;
    return confirmPairingCredential(cfg, base);
  }
  (void)persistPairingRetry(cfg, "pairing_pending");
  lastDeviceErrorCode = "DEVICE-PAIRING-TIMEOUT";
  lastDeviceErrorMessage = "管理員核准尚未完成；保留 pairing state 並等待 bounded backoff";
  return false;
}

