steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
void reportDeviceStatus(Config &cfg, bool displayUpdated) {
  if (WiFi.status() != WL_CONNECTED || cfg.backend_hostport.length() == 0 || !hasDeviceCredential(cfg)) return;
  String base;
  if (!normalizedBackendBase(cfg, base)) return;

#if INKTIME_PHOTOPAINTER_ENABLED
  photoPainter.readEnvironment();
#endif
  JsonDocument payload;
  payload["firmware_version"] = INKTIME_FIRMWARE_VERSION;
  payload["board_profile"] = kBoardConfig.name;
  payload["wifi_rssi"] = WiFi.RSSI();
  payload["free_heap_bytes"] = ESP.getFreeHeap();
  payload["free_psram_bytes"] = ESP.getFreePsram();
  payload["wake_reason"] = String((int)esp_sleep_get_wakeup_cause());
  payload["display_updated"] = displayUpdated;
  payload["display_skipped"] = currentDisplaySkipped;
  if (currentDisplaySkipped) payload["display_skip_reason"] = "same_sha256";
  payload["payload_sha256_verified"] = currentPayloadShaVerified;
  payload["applied_config_version"] = cfg.config_version;
  payload["panel_profile"] = INKTIME_PANEL_PROFILE;
  payload["render_profile"] = currentRenderProfile;
  payload["release_id"] = currentReleaseId;
  payload["error_code"] = lastDeviceErrorCode;
  payload["error_message"] = lastDeviceErrorMessage;
  payload["warning_code"] = lastDeviceWarningCode;
  payload["warning_message"] = lastDeviceWarningMessage;
#if INKTIME_ALLOW_INSECURE_DEVICE_HTTP
  payload["transport_profile"] = "trusted-lan-http";
  payload["transport_security_state"] = "degraded";
  payload["transport_warning"] = "no_tls";
#else
  payload["transport_profile"] = "https-only";
  payload["transport_security_state"] = "secure-required";
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
  payload["flash_bytes"] = ESP.getFlashChipSize();
  payload["psram_bytes"] = ESP.getPsramSize();
  payload["flash_ready"] = photoPainter.flashReady();
  payload["psram_ready"] = photoPainter.psramReady();
  payload["sd_card"] = photoPainter.sdReady();
  payload["rtc"] = photoPainter.rtcReady();
  payload["cache_status"] = inktime::cacheStatusName(photoPainter.cacheStatus());
  payload["pmic_type"] = inktime::pmicTypeName(photoPainter.pmicType());
  payload["usb_power"] = photoPainter.usbConnected();
  if (photoPainter.batteryVoltage() > 0.0f) {
    payload["battery_voltage"] = photoPainter.batteryVoltage();
  }
  if (photoPainter.batteryPercent() >= 0) {
    payload["battery_percent"] = photoPainter.batteryPercent();
    payload["battery_percent_estimated"] = true;
  }
  if (photoPainter.environmentValid()) {
    payload["temperature_c"] = photoPainter.temperatureC();
    payload["humidity_percent"] = photoPainter.humidityPercent();
  }
  payload["button_wakeup"] = photoPainter.wokeFromUserButton();
#endif
  payload["last_refresh_duration_ms"] = lastRefreshDurationMs;
  payload["wake_duration_ms"] = millis();
  String body;
  serializeJson(payload, body);

  inktime::DeviceHttpTransport statusTransport(cfg.ca_pem);
  HTTPClient statusHttp;
  String statusTransportCode;
  String statusTransportMessage;
  if (!statusTransport.begin(
        statusHttp, base + String(DEVICE_STATUS_PATH), 15000,
        statusTransportCode, statusTransportMessage)) {
    lastDeviceErrorCode = statusTransportCode;
    lastDeviceErrorMessage = statusTransportMessage;
    return;
  }
  if (!addDeviceAuthorization(statusHttp, cfg)) {
    statusHttp.end();
    return;
  }
  statusHttp.addHeader("Content-Type", "application/json");
  const int status = statusHttp.POST(body);
  (void)handleDeviceAuthStatus(cfg, status);
  statusHttp.end();
}

// =======================
//  墨水屏显示
// =======================
void initDisplay(const Config &cfg) {
#if INKTIME_PHOTOPAINTER_ENABLED
  (void)cfg;
#else
#if DEBUG_LOG
  DBG_PRINTLN("[EPD] initDisplay");
#endif
  SPI.end();
  SPI.begin(
    kBoardConfig.display.spi.sck,
    kBoardConfig.display.spi.miso,
    kBoardConfig.display.spi.mosi,
    kBoardConfig.display.spi.cs
  );

  display.init(0, true, 2, false);

  if (cfg.rotate180) display.setRotation(3);
  else              display.setRotation(1);
#endif
}

#if !INKTIME_PHOTOPAINTER_ENABLED
static bool displayPairingCode(const Config &cfg, const String &pairingCode) {
  initDisplay(cfg);
  const uint32_t refreshStarted = millis();
  display.setFullWindow();
  display.firstPage();
  do {
    display.fillScreen(GxEPD_WHITE);
    display.setTextColor(GxEPD_BLACK);
    display.setTextSize(2);
    display.setCursor(20, 90);
    display.print("INKTIME PAIRING");
    display.setCursor(20, 180);
    display.print("CODE:");
    display.setCursor(20, 235);
    display.setTextSize(4);
    display.print(pairingCode);
    display.setTextSize(2);
    display.setCursor(20, 330);
    display.print("VALID 5 MIN");
  } while (display.nextPage());
  display.hibernate();
  lastRefreshDurationMs = millis() - refreshStarted;
  return true;
}
#endif

bool drawFromFrameData(const Config &cfg) {
  (void)cfg;

#if INKTIME_PHOTOPAINTER_ENABLED
  if (!frameNativePalette || frameDataSize != inktime::kPhotoPainterFrameBytes) return false;
  const bool updated = photoPainter.displayFrame(frameData, frameDataSize);
  lastRefreshDurationMs = photoPainter.lastRefreshDurationMs();
  return updated;
#else

  const uint32_t refreshStarted = millis();
  display.setFullWindow();
  int w = display.width();   // 480
  int h = display.height();  // 800

#if DEBUG_LOG
  DBG_PRINT("[EPD] logical w="); DBG_PRINT(w);
  DBG_PRINT(" h="); DBG_PRINTLN(h);
#endif

  display.firstPage();
  do {
    for (int y = 0; y < FB_HEIGHT && y < h; ++y) {
      for (int x = 0; x < FB_WIDTH && x < w; ++x) {
        size_t pixel = (size_t)y * FB_WIDTH + x;
        uint8_t packed = frameData[pixel / (frameIndexed4 ? 2 : 4)];
        uint8_t c = frameIndexed4
          ? ((pixel % 2 == 0) ? (packed >> 4) : (packed & 0x0F))
          : ((packed >> (6 - (pixel % 4) * 2)) & 0x03);
        uint16_t col;
        if (frameIndexed4) {
          switch (c) {
            case 0: col = GxEPD_BLACK;  break;
            case 1: col = GxEPD_WHITE;  break;
            case 2: col = GxEPD_GREEN;  break;
            case 3: col = GxEPD_BLUE;   break;
            case 4: col = GxEPD_RED;    break;
            case 5: col = GxEPD_YELLOW; break;
            case 6: col = GxEPD_ORANGE; break;
            default: col = GxEPD_WHITE; break;
          }
        } else {
          switch (c) {
            case 0: col = GxEPD_BLACK;  break;
            case 1: col = GxEPD_WHITE;  break;
            case 2: col = GxEPD_RED;    break;
            case 3: col = GxEPD_YELLOW; break;
            default: col = GxEPD_WHITE; break;
          }
        }
        display.drawPixel(x, y, col);
      }
    }
  } while (display.nextPage());

  lastRefreshDurationMs = millis() - refreshStarted;
  display.hibernate();
  return true;
#endif
}

// =======================
//  睡到下一个唤醒点
// =======================
void sleepUntilNextSchedule(const Config &cfg, bool hasTime, const struct tm &now) {
#if INKTIME_PHOTOPAINTER_ENABLED
  if (offlineScheduleTxnBlocked) {
    goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
    return;
  }
  if (cfg.delivery_mode == "inktime_offline_schedule") {
    if (!hasTime) {
      // Unknown time is a bounded recovery wake, never a 24-hour blind sleep.
      goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
      return;
    }
    time_t nowEpoch = time(nullptr);
    if (nowEpoch <= 0) {
      time_t rtcEpoch = 0;
      if (photoPainter.readRtc(rtcEpoch)) nowEpoch = rtcEpoch;
    }
    if (nowEpoch > 0) {
      time_t nextDisplay = 0;
      time_t targetEnd = 0;
      time_t nextSchedulePrefetch = 0;
      if (activeOfflineEpochs(nowEpoch, nextDisplay, targetEnd, nextSchedulePrefetch)) {
        time_t wakeEpoch = 0;
        const auto considerWake = [&wakeEpoch, nowEpoch](time_t candidate) {
          if (candidate > nowEpoch && (wakeEpoch == 0 || candidate < wakeEpoch)) {
            wakeEpoch = candidate;
          }
        };
        if (nextDisplay > nowEpoch) {
          const uint64_t leadSeconds = static_cast<uint64_t>(cfg.prefetch_lead_minutes) * 60ULL;
          const time_t prefetchEpoch = nextDisplay > static_cast<time_t>(leadSeconds)
            ? nextDisplay - static_cast<time_t>(leadSeconds)
            : nextDisplay;
          considerWake(prefetchEpoch > nowEpoch ? prefetchEpoch : nextDisplay);
        }
        // The next schedule's server/IANA-computed technical deadline is an
        // independent wake candidate and may occur before today's end.
        considerWake(nextSchedulePrefetch);
        considerWake(targetEnd);
        uint8_t retryAttempt = 0;
        int64_t retryEpoch = 0;
        int64_t retryNextSlot = 0;
        if (loadOfflineRetryState(retryAttempt, retryEpoch, retryNextSlot)
            && inktime::validOfflineRetryEpoch(
              static_cast<uint64_t>(nowEpoch), retryEpoch, retryNextSlot)) {
          considerWake(static_cast<time_t>(retryEpoch));
        }
        if (wakeEpoch > nowEpoch) {
          goDeepSleepUntilEpoch(nowEpoch, wakeEpoch);
          return;
        }
        // An exhausted day uses the same persisted bounded recovery plan as
        // a missing schedule, instead of a one-minute storm.
        const time_t recoveryEpoch = scheduleOfflineRecovery(nowEpoch);
        if (recoveryEpoch > nowEpoch) goDeepSleepUntilEpoch(nowEpoch, recoveryEpoch);
        else goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
        return;
      }
      const time_t recoveryEpoch = scheduleOfflineRecovery(nowEpoch);
      if (recoveryEpoch > nowEpoch) goDeepSleepUntilEpoch(nowEpoch, recoveryEpoch);
      else goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
      return;
    }
    goDeepSleepSeconds(inktime::kOfflineRetryFirstSeconds);
    return;
  }
#endif
  if (!hasTime) {
    goDeepSleepMinutes(1440);
    return;
  }

